-- phpMyAdmin SQL Dump
-- version 4.8.3
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Ноя 06 2018 г., 08:43
-- Версия сервера: 5.7.23
-- Версия PHP: 7.2.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `schedule`
--

-- --------------------------------------------------------

--
-- Структура таблицы `uchebnij_plan`
--

DROP TABLE IF EXISTS `uchebnij_plan`;
CREATE TABLE IF NOT EXISTS `uchebnij_plan` (
  `Kod_uchebnogo_plana` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `Kod_napravleniay_podgotovki` char(8) COLLATE utf8_unicode_ci NOT NULL,
  `Napravlinie` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `Profil` varchar(100) CHARACTER SET utf32 COLLATE utf32_unicode_ci NOT NULL,
  `God_nabora` smallint(4) NOT NULL,
  PRIMARY KEY (`Kod_uchebnogo_plana`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `uchebnij_plan`
--

INSERT INTO `uchebnij_plan` (`Kod_uchebnogo_plana`, `Kod_napravleniay_podgotovki`, `Napravlinie`, `Profil`, `God_nabora`) VALUES
('15_03.03.03_РЭУ', '03.03.03', 'Радиофизика', 'Радиоэлектронные устройства, методы обработки сигналов и автоматизации', 2015),
('15_03.03.03_ТКС', '03.03.03', 'Радиофизика', 'Телекоммуникационные системы и информационные технологии', 2015),
('16_03.03.03_ТКС', '03.03.03', 'Радиофизика', 'Телекоммуникационные системы и информационные технологии', 2016),
('16_03.03.03_РЭУ', '03.03.03', 'Радиофизика', 'Радиоэлектронные устройства, методы обработки сигналов и автоматизации', 2016),
('17_03.03.03_ТКС', '03.03.03', 'Радиофизика', 'Телекоммуникационные системы и информационные технологии', 2017),
('17_03.03.03_РЭУ', '03.03.03', 'Радиофизика', 'Радиоэлектронные устройства, методы обработки сигналов и автоматизации', 2017),
('18_03.03.03_ТКС', '03.03.03', 'Радиофизика', 'Телекоммуникационные системы и информационные технологии', 2018),
('18_03.03.03_РЭУ', '03.03.03', 'Радиофизика', 'Радиоэлектронные устройства, методы обработки сигналов и автоматизации', 2018),
('15_03.03.02_ФФ', '03.03.02', 'Физика', 'Фундаментальная физика', 2015),
('15_03.03.02_ФКС', '03.03.02', 'Физика', 'Физика конденсированного состояния', 2015),
('15_03.03.02_СЗФ', '03.03.02', 'Физика', 'Солнечно-земная физика', 2015),
('16_03.03.02_ФФ', '03.03.02', 'Физика', 'Фундаментальная физика', 2016),
('16_03.03.02_ФКС', '03.03.02', 'Физика', 'Физика конденсированного состояния', 2016),
('16_03.03.02_СЗФ', '03.03.02', 'Физика', 'Солнечно-земная физика', 2016),
('17_03.03.02_ФФ', '03.03.02', 'Физика', 'Фундаментальная физика', 2017),
('17_03.03.02_ФКС', '03.03.02', 'Физика', 'Физика конденсированного состояния', 2017),
('17_03.03.02_СЗФ', '03.03.02', 'Физика', 'Солнечно-земная физика', 2017),
('18_03.03.02_ФФ', '03.03.02', 'Физика', 'Фундаментальная физика', 2018),
('18_03.03.02_ФКС', '03.03.02', 'Физика', 'Физика конденсированного состояния', 2018),
('18_03.03.02_СЗФ', '03.03.02', 'Физика', 'Солнечно-земная физика', 2018),
('15_11.03.04', '11.03.04', 'Электроника и наноэлектроника', 'Материалы и компоненты твердотельной электроники', 2015),
('16_11.03.04', '11.03.04', 'Электроника и наноэлектроника', 'Материалы и компоненты твердотельной электроники', 2016),
('17_11.03.04', '11.03.04', 'Электроника и наноэлектроника', 'Материалы и компоненты твердотельной электроники', 2017),
('18_11.03.04', '11.03.04', 'Электроника и наноэлектроника', 'Материалы и компоненты твердотельной электроники', 2018),
('18_10.03.01', '10.03.01', 'Информационная безопасность', 'Техническая защита информации', 2017),
('17_03.04.03', '03.04.03', 'Радиофизика', 'Информационные профессы и системы', 2017),
('18_03.04.03', '03.04.03', 'Радиофизика', 'Информационные профессы и системы', 2018),
('17_03.04.02', '03.04.02', 'Физика', 'Теоретическая физика', 2017),
('18_03.04.02', '03.04.02', 'Физика', 'Теоретическая физика', 2018),
('17_11.04.04', '11.04.04', 'Электроника и наноэлектроника', 'Материалы и компоненты твердотельной электроники', 2017),
('18_11.04.04', '11.04.04', 'Электроника и наноэлектроника', 'Материалы и компоненты твердотельной электроники', 2018);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
