-- phpMyAdmin SQL Dump
-- version 4.8.3
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Ноя 05 2018 г., 05:54
-- Версия сервера: 5.7.23
-- Версия PHP: 7.2.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `schedule_prj`
--

-- --------------------------------------------------------

--
-- Структура таблицы `groups`
--

DROP TABLE IF EXISTS `groups`;
CREATE TABLE IF NOT EXISTS `groups` (
  `Номер группы` char(8) COLLATE utf8_unicode_ci NOT NULL,
  `Код учебного плана` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `Количество студентов` int(3) NOT NULL,
  PRIMARY KEY (`Код учебного плана`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `groups`
--

INSERT INTO `groups` (`Номер группы`, `Код учебного плана`, `Количество студентов`) VALUES
('01111-ДБ', '18_03.03.02_ФФ', 11),
('01111-ДБ', '18_03.03.02_ФКС', 11),
('01111-ДБ', '18_03.03.02_СЗФ', 10),
('01121-ДБ', '18_03.03.03_ТКС', 22),
('01122-ДБ', '18_03.03.03_РЭУ', 23),
('01131-ДБ', '18_11.03.04', 25),
('01141-ДБ', '18_10.03.01', 25),
('01211-ДБ', '17_03.03.02_ФФ', 10),
('01211-ДБ', '17_03.03.02_ФКС', 10),
('01211-ДБ', '17_03.03.02_СЗФ', 10),
('01221-ДБ', '17_03.03.03_ТКС', 16),
('01222-ДБ', '17_03.03.03_РЭУ', 17),
('01231-ДБ', '17_11.03.04', 20),
('01311-ДБ', '16_03.03.02_ФФ', 8),
('01311-ДБ', '16_03.03.02_ФКС', 8),
('01311-ДБ', '16_03.03.02_СЗФ', 9),
('01321-ДБ', '16_03.03.03_ТКС', 16),
('01322-ДБ', '16_03.03.03_РЭУ', 16),
('01331-ДБ', '16_11.03.04', 9),
('01411-ДБ', '15_03.03.02_ФФ', 5),
('01411-ДБ', '15_03.03.02_ФКС', 5),
('01411-ДБ', '15_03.03.02_СЗФ', 5),
('01421-ДБ', '15_03.03.03_ТКС', 10),
('01422-ДБ', '15_03.03.03_РЭУ', 9),
('01431-ДБ', '15_11.03.04', 5),
('01111-ДМ', '18_03.04.02', 5),
('01121-ДМ', '18_03.04.03', 6),
('01131-ДМ', '18_11.04.04', 10),
('01221-ДМ', '17_03.04.03', 4),
('01231-ДМ', '17_11.04.04', 14);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
